OpenFOAM-dev/tutorials/incompressibleVoF/mixerVessel/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 125000;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    oilInlet
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    outlet
    {
        type            fixedValue;
        value           $internalField;
    }

    wall
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    nonCouple
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
}


// ************************************************************************* //
