OpenFOAM-dev/tutorials/incompressibleVoF/mixerVessel/system/functions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      functions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#includeFunc cutPlaneSurface
(
    point=(0 0 0),
    normal=(1 -1 0),
    interpolate=no,
    alpha.oil,
    p_rgh,
    U
)

// ************************************************************************* //
